[
    {
        "name" : "(WIP) VR Training House", 
        "description" : "A VR experience used to train officers within the Lancashire Constabulary on how to interact with digital devices. With a keen focus on the usability and accessibility of the experience and device interactions.",
        "tech" : "Unity | C# | XR Interaction Toolkit",
        "imageSrc" : "../Images/VR House Cover Image.jpg",
        "imageAlt" : "VR digital training house cover image",
        "linkText" : "",
        "linkSrc" : ""
    },
    {
        "name" : "(WIP) Unreal Brawler Project", 
        "description" : "A third-person brawler game set in a Norse inspired futuristic world. Created in collaboration with a small team in Unreal Engine 4, with my focus being to develop the AI, backend animation and UI systems.",
        "tech" : "Unreal Engine 4 | C++ | Blueprints",
        "imageSrc" : "../Images/UEB Cover Image.jpg",
        "imageAlt" : "Unreal brawler cover image",
        "linkText" : "",
        "linkSrc" : ""
    },
    {
        "name" : "3D Object Manipulation in AR (BSc Project)", 
        "description" : "This project forms the basis for the research paper I wrote and submitted to an international conference, as well as my BSc dissertation. It includes a unique and novel technique for 3D object interaction in AR on mobile devices, as well as the various applications used for developing and evaluating this technique.",
        "tech" : "Unity | C# | ARFoundation",
        "imageSrc" : "../Images/TYP Cover Image.jpg",
        "imageAlt" : "Object manipulation cover image",
    },
    {
        "name" : "Portfolio Website", 
        "description" : "This website. This was an experiment into developing a website from scratch without using any web frameworks and was intended to increase my experience and aptitude with HTML, CSS, and JS. This website dynamically creates and populates the project cards and project content from JSON files.",
        "tech" : "JS | HTML | CSS",
        "imageSrc" : "../Images/Website Cover Image.jpg",
        "imageAlt" : "Portfolio website cover image",
    }
]